<?php
// +----------------------------------------------------------------------
// | 缓存配置
// +----------------------------------------------------------------------

return [
    // 地址
    'host' => '127.0.0.1',
    // 端口
    'port' => 6379,
    // 密码
    'password' => '123123',
    // 使用几号数据库
    'select' => 0,
    // 连接超时时间 0表示无限制
    'timeout' => 0,
    // 缓存有效期 0表示永久缓存
    'expire' => 0,
    // 是否长链接
    'persistent' => false,
    // 缓存前缀
    'prefix' => '',
    // 序列化机制 例如 ['serialize', 'unserialize']
    'serialize' => [],
];